GadgetSeed/gadgetseed/arch/Cortex-M7/drivers/stm32h747i-disc_ether.c
/** @file
    @brief	STM32H747I Discovery Ether

    @date	2020.02.01
    @author	Takashi SHUDO
*/

#include "sysconfig.h"
#include "device.h"
#include "interrupt.h"
#include "str.h"
#include "tkprintf.h"
#include "device/ether_ioctl.h"
#include "task/event.h"
#include "task/syscall.h"

#include "stm32h7xx_hal_conf.h"
#include "stm32h7xx_hal_eth.h"
#include "stm32h7xx_hal.h"
#include "lan8742.h"

#include "lwip/pbuf.h"
#include "lwip/memp.h"

//#define DEBUGKBITS 0x10
#include "dkprintf.h"


#ifndef GSC_ETHERDEV_DEFAULT_MACADDRESS	// $gsc EtherデバイスデフォルトMACアドレス
static unsigned char macaddress[6] = { 0x02, 0x00, 0x00, 0x00, 0x00, 0x01 };
#else
static unsigned char macaddress[6] = {
	(GSC_ETHERDEV_DEFAULT_MACADDRESS >> 40) & 0xff,
	(GSC_ETHERDEV_DEFAULT_MACADDRESS >> 32) & 0xff,
	(GSC_ETHERDEV_DEFAULT_MACADDRESS >> 24) & 0xff,
	(GSC_ETHERDEV_DEFAULT_MACADDRESS >> 16) & 0xff,
	(GSC_ETHERDEV_DEFAULT_MACADDRESS >>  8) & 0xff,
	(GSC_ETHERDEV_DEFAULT_MACADDRESS >>  0) & 0xff
};
#endif

#define ETH_RX_BUFFER_SIZE	(1536UL)
#define ETH_RX_BUFFER_COUNT     20	/* This app buffers receive packets of its primary service
					 * protocol for processing later. */

static unsigned char ether_event[ETH_RX_BUFFER_COUNT + 1];
static struct st_event interrupt_evtque;
static ETH_HandleTypeDef EthHandle;
static void *int_sp;
static int flgs_int = 0;
#define FLG_RX	0x01
#define FLG_TX	0x02
#define FLG_ER	0x04

ETH_TxPacketConfig TxConfig;
lan8742_Object_t LAN8742;

int32_t ETH_PHY_IO_Init(void);
int32_t ETH_PHY_IO_DeInit (void);
int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t *pRegVal);
int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal);
int32_t ETH_PHY_IO_GetTick(void);

lan8742_IOCtx_t  LAN8742_IOCtx = {ETH_PHY_IO_Init,
				  ETH_PHY_IO_DeInit,
				  ETH_PHY_IO_WriteReg,
				  ETH_PHY_IO_ReadReg,
				  ETH_PHY_IO_GetTick};

typedef struct
{
  struct pbuf_custom pbuf_custom;
#if ETH_RX_BUFFERS_ARE_CACHED
  uint8_t buff[(ETH_RX_BUFFER_SIZE + 31) & ~31] __ALIGNED(32);
#else
  uint8_t buff[(ETH_RX_BUFFER_SIZE + 3) & ~3] __ALIGNED(4);
#endif
} RxBuff_t;

ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDescripSection")));/* Ethernet Rx DMA Descriptor */
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDescripSection")));/* Ethernet Tx DMA Descriptor */
//uint8_t Rx_Buff[ETH_RX_DESC_CNT][ETH_RX_BUFFER_SIZE] __attribute__((section(".RxBUF")));/* Ethernet Receive Buffer */
//uint8_t Rx_Buff2[ETH_RX_DESC_CNT][ETH_RX_BUFFER_SIZE] __attribute__((section(".RxBUF")));/* Ethernet Receive Buffer */
RxBuff_t EthIfRxBuff[ETH_RX_BUFFER_COUNT] __attribute__((aligned(32), section(".RxBUF"))); /* Ethernet Rx Buffers */
//uint8_t Tx_Buff[ETH_TX_DESC_CNT][ETH_TX_BUF_SIZE] __attribute__((section(".TxBUF")));/* Ethernet Transmit Buffer */

/* LwIP Memory pool descriptor for EthIfRxBuff.
 * This does the same as LWIP_MEMPOOL_DECLARE, except EthIfRxBuff's defined
 * separately for special section placement. */
#if MEMP_STATS
  static struct stats_mem memp_stats_EthIfRxBuff;
#endif
static struct memp *memp_tab_EthIfRxBuff;
static const struct memp_desc memp_EthIfRxBuff = {
#if defined(LWIP_DEBUG) || MEMP_OVERFLOW_CHECK || LWIP_STATS_DISPLAY
	.desc = "RxBuff Pool",
#endif
#if MEMP_STATS
	.stats = &memp_stats_EthIfRxBuff,
#endif
	.size = LWIP_MEM_ALIGN_SIZE(sizeof(RxBuff_t)),
	.num = ETH_RX_BUFFER_COUNT,
	.base = (uint8_t *)EthIfRxBuff,
	.tab = &memp_tab_EthIfRxBuff
};

/* Flag when RxBuffAlloc exhausts the Rx Buffer Pool, so the next RxPktDiscard will
 * repopulate the buffers of the Rx DMA Descriptors. */
static uint8_t RxBuffEmpty;


#if ETH_TX_QUEUE_ENABLE
/* Queue for packet transmit. */
typedef struct TxQueue_t
{
  struct TxQueue_t *next;
  struct pbuf *p;
} TxQueue_t;

static TxQueue_t TxQueue[ETH_TX_QUEUE_SIZE];
static TxQueue_t *TxQueueFree, *TxQueueHead, *TxQueueTail;
#endif /* ETH_TX_QUEUE_ENABLE */

/* USER CODE BEGIN 2 */
/* Relocate the LwIP heap via the ".TxArraySection" section to SRAM3 in the D2 domain.
 * LWIP_RAM_HEAP_POINTER defined in lwipopts.h points to this memory and its definition
 * there prevents LwIP defining its memory.
 */
// START Copy from LwIP's mem.c
struct mem {
  /** index (-> ram[next]) of the next struct */
  mem_size_t next;
  /** index (-> ram[prev]) of the previous struct */
  mem_size_t prev;
  /** 1: this area is used; 0: this area is unused */
  u8_t used;
};
#define SIZEOF_STRUCT_MEM    LWIP_MEM_ALIGN_SIZE(sizeof(struct mem))
#define MEM_SIZE_ALIGNED     LWIP_MEM_ALIGN_SIZE(MEM_SIZE)
// END Copy from LwIP's mem.c
uint8_t lwip_custom_ram_heap[MEM_SIZE_ALIGNED + (2U*SIZEOF_STRUCT_MEM)] __attribute__((section(".TxArraySection")));

/* USER CODE END 2 */


/*******************************************************************************
		PHI IO Functions
*******************************************************************************/
/**
  * @brief  Initializes the MDIO interface GPIO and clocks.
  * @param  None
  * @retval 0 if OK, -1 if ERROR
  */
int32_t ETH_PHY_IO_Init(void)
{
	/* We assume that MDIO GPIO configuration is already done
	   in the ETH_MspInit() else it should be done here
	*/

	/* Configure the MDIO Clock */
	HAL_ETH_SetMDIOClockRange(&EthHandle);

	return 0;
}

/**
  * @brief  De-Initializes the MDIO interface .
  * @param  None
  * @retval 0 if OK, -1 if ERROR
  */
int32_t ETH_PHY_IO_DeInit (void)
{
	return 0;
}

/**
  * @brief  Read a PHY register through the MDIO interface.
  * @param  DevAddr: PHY port address
  * @param  RegAddr: PHY register address
  * @param  pRegVal: pointer to hold the register value
  * @retval 0 if OK -1 if Error
  */
int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t *pRegVal)
{
	int32_t rt;

	rt =  HAL_ETH_ReadPHYRegister(&EthHandle, DevAddr, RegAddr, pRegVal);

	if(rt != HAL_OK) {
		SYSERR_PRINT("HAL_ETH_ReadPHYRegister error(%ld)\n", rt);
		return -1;
	}

	DKFPRINTF(0x01, "RegAddr = %lX, RegVal = %lX\n", RegAddr, *pRegVal);

