GadgetSeed/gadgetseed/arch/Cortex-M7/drivers/stm32h747i-disc_ether.c
	return 0;
}

/**
  * @brief  Write a value to a PHY register through the MDIO interface.
  * @param  DevAddr: PHY port address
  * @param  RegAddr: PHY register address
  * @param  RegVal: Value to be written
  * @retval 0 if OK -1 if Error
  */
int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal)
{
	int32_t rt;

	DKFPRINTF(0x01, "RegAddr = %lX, RegVal = %lX\n", RegAddr, RegVal);

	rt =  HAL_ETH_WritePHYRegister(&EthHandle, DevAddr, RegAddr, RegVal);
	if(rt != HAL_OK) {
		SYSERR_PRINT("HAL_ETH_WritePHYRegister error(%ld)\n", rt);
		return -1;
	}

	return 0;
}

/**
  * @brief  Get the time in millisecons used for internal PHY driver process.
  * @retval Time value
  */
int32_t ETH_PHY_IO_GetTick(void)
{
	int32_t rt = HAL_GetTick();

	DKPRINTF(0x01, "Tick = %ld\n", rt);

	return rt;
}

int eth_rx_count = 0;

void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
	DKFPRINTF(0x01, "\n");

	flgs_int |= FLG_RX;

	eth_rx_count ++;
}

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth)
{
	DKFPRINTF(0x10, "\n");

	flgs_int |= FLG_TX;
}

void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth)
{
	DKFPRINTF(0xff, "\n");
	SYSERR_PRINT("error?\n");

	flgs_int |= FLG_ER;
}

static void inthdr_ether(unsigned int intnum, void *sp)
{
	DKFPRINTF(0x01, "\n");

	int_sp = sp;
	flgs_int = 0;

	HAL_ETH_IRQHandler(&EthHandle);

	DKFPRINTF(0x01, "flgs_int = %02x\n", flgs_int);

	if(flgs_int & FLG_RX) {
		DKPRINTF(0x04, "*");
		DKFPRINTF(0x03, "wakeup\n");
		event_wakeup_ISR(int_sp, &interrupt_evtque, 0);
	}
}

/* Private defines -----------------------------------------------------------*/
#define ETH_TX_EN_Pin GPIO_PIN_11
#define ETH_TX_EN_GPIO_Port GPIOG
#define OSC32_OUT_Pin GPIO_PIN_15
#define OSC32_OUT_GPIO_Port GPIOC
#define OSC32_IN_Pin GPIO_PIN_14
#define OSC32_IN_GPIO_Port GPIOC
#define ETH_TXD1_Pin GPIO_PIN_12
#define ETH_TXD1_GPIO_Port GPIOG
#define ETH_TXD0_Pin GPIO_PIN_13
#define ETH_TXD0_GPIO_Port GPIOG
#define CEC_CK_MCO1_Pin GPIO_PIN_8
#define CEC_CK_MCO1_GPIO_Port GPIOA
#define OSC_OUT_Pin GPIO_PIN_1
#define OSC_OUT_GPIO_Port GPIOH
#define OSC_IN_Pin GPIO_PIN_0
#define OSC_IN_GPIO_Port GPIOH
#define ETH_MDC_SAI4_D1_Pin GPIO_PIN_1
#define ETH_MDC_SAI4_D1_GPIO_Port GPIOC
#define ETH_MDIO_Pin GPIO_PIN_2
#define ETH_MDIO_GPIO_Port GPIOA
#define ETH_REF_CLK_Pin GPIO_PIN_1
#define ETH_REF_CLK_GPIO_Port GPIOA
#define ETH_CRS_DV_Pin GPIO_PIN_7
#define ETH_CRS_DV_GPIO_Port GPIOA
#define ETH_RXD0_Pin GPIO_PIN_4
#define ETH_RXD0_GPIO_Port GPIOC
#define ETH_RXD1_Pin GPIO_PIN_5
#define ETH_RXD1_GPIO_Port GPIOC

void HAL_ETH_MspInit(ETH_HandleTypeDef* heth)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};

	DKFPRINTF(0x01, "\n");

	/* Peripheral clock enable */
	__HAL_RCC_ETH1MAC_CLK_ENABLE();
	__HAL_RCC_ETH1TX_CLK_ENABLE();
	__HAL_RCC_ETH1RX_CLK_ENABLE();

	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	/**ETH GPIO Configuration
	   PG11     ------> ETH_TX_EN
	   PG12     ------> ETH_TXD1
	   PG13     ------> ETH_TXD0
	   PC1     ------> ETH_MDC
	   PA2     ------> ETH_MDIO
	   PA1     ------> ETH_REF_CLK
	   PA7     ------> ETH_CRS_DV
	   PC4     ------> ETH_RXD0
	   PC5     ------> ETH_RXD1
	*/
	GPIO_InitStruct.Pin = ETH_TX_EN_Pin|ETH_TXD1_Pin|ETH_TXD0_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
	HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = ETH_MDC_SAI4_D1_Pin|ETH_RXD0_Pin|ETH_RXD1_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = ETH_MDIO_Pin|ETH_REF_CLK_Pin|ETH_CRS_DV_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

static int ethernet_link_check_state(void)
{
	ETH_MACConfigTypeDef MACConf;
	uint32_t PHYLinkState;
	uint32_t linkchanged = 0, speed = 0, duplex =0;
	int stat = 0;

	PHYLinkState = LAN8742_GetLinkState(&LAN8742);
	DKPRINTF(0x01, "PHYLinkState = %lu\n", PHYLinkState);

	if(PHYLinkState <= LAN8742_STATUS_LINK_DOWN) {
		HAL_ETH_Stop(&EthHandle);
		DKPRINTF(0x01, "PHY Link DOWN\n");
	} else if(PHYLinkState > LAN8742_STATUS_LINK_DOWN) {

		stat |= IORTN_BIT_ETHER_LINK_UP;
		DKPRINTF(0x01, "PHY Link UP\n");

		switch(PHYLinkState) {
		case LAN8742_STATUS_100MBITS_FULLDUPLEX:
			stat |= IORTN_BIT_ETHER_100M;
			stat |= IORTN_BIT_ETHER_FULLDUPLEX;
			duplex = ETH_FULLDUPLEX_MODE;
			speed = ETH_SPEED_100M;
			linkchanged = 1;
			DKPRINTF(0x01, "100M FULL\n");
			break;

		case LAN8742_STATUS_100MBITS_HALFDUPLEX:
			stat |= IORTN_BIT_ETHER_100M;
			duplex = ETH_HALFDUPLEX_MODE;
			speed = ETH_SPEED_100M;
			linkchanged = 1;
			DKPRINTF(0x01, "100M HALF\n");
			break;

		case LAN8742_STATUS_10MBITS_FULLDUPLEX:
			stat |= IORTN_BIT_ETHER_FULLDUPLEX;
			duplex = ETH_FULLDUPLEX_MODE;
			speed = ETH_SPEED_10M;
			linkchanged = 1;
			DKPRINTF(0x01, "10M FULL\n");
			break;

		case LAN8742_STATUS_10MBITS_HALFDUPLEX:
			duplex = ETH_HALFDUPLEX_MODE;
			speed = ETH_SPEED_10M;
			linkchanged = 1;
			DKPRINTF(0x01, "10M HALF\n");
			break;

		default:
			break;
		}

		if(linkchanged) {
			duplex = ETH_FULLDUPLEX_MODE;	//!!! 強制的に100M FULLに設定すると何故か動く
			speed = ETH_SPEED_100M;		//!!!
			/* Get MAC Config MAC */
			HAL_ETH_GetMACConfig(&EthHandle, &MACConf);
			MACConf.DuplexMode = duplex;
			MACConf.Speed = speed;
			HAL_ETH_SetMACConfig(&EthHandle, &MACConf);
		}
	}

	return stat;
}


/**
  * @brief  Custom free for the Rx Buffer Pool.
  * @param  p Pointer to the packet buffer struct.
  * @retval None
  */
static void RxPoolCustomFree(struct pbuf *p)
{
  LWIP_MEMPOOL_FREE(EthIfRxBuff, p);

  /* If the Rx Buffer Pool was exhausted, signal the ethernetif_input task to
   * call HAL_ETH_GetRxDataBuffer to rebuild the Rx descriptors. */
  if (RxBuffEmpty)
  {
//    xTaskNotifyGive(EthIfThread);
    RxBuffEmpty = 0;
  }
}

/**
  * @brief  Callback function given to the ETH driver at init to allocate a
  *         buffer.
  * @retval Pointer to the buffer, or NULL if no buffers are available.
  */
static uint8_t *RxBuffAlloc(void)
{
  struct pbuf_custom *p = LWIP_MEMPOOL_ALLOC(EthIfRxBuff);
  uint8_t *buff;

