GadgetSeed/gadgetseed/arch/Cortex-M7/drivers/stm32h747i-disc_ether.c
  if (p)
  {
    /* Get the buff from the struct pbuf address. */
    buff = (uint8_t *)p + offsetof(RxBuff_t, buff);

    /* Initialize the struct pbuf.
     * This must be performed whenever a buffer's allocated because it may be
     * changed by lwIP or the app, e.g., pbuf_free decrements ref. */
    pbuf_alloced_custom(PBUF_RAW, 0, PBUF_REF, p, buff, ETH_RX_BUFFER_SIZE);
  }
  else
  {
    /* Rx Buffer Pool is exhausted. */
    RxBuffEmpty = 1;
    buff = NULL;
  }

  return buff;
}

/**
  * @brief  Callback function given to the ETH driver at init to free a buffer.
  * @param  buff Pointer to the buffer, or NULL if no buffers are available.
  * @retval None
  */
static void RxBuffFree(uint8_t *buff)
{
  struct pbuf *p;

  /* Get the struct pbuf from the buff address. */
  p = (struct pbuf *)(buff - offsetof(RxBuff_t, buff));
  RxPoolCustomFree(p);
}

/**
  * @brief  Callback function given to the ETH driver at init to chain buffers
  *         as a packet.
  * @param  ppPktFirst Double-pointer to the first packet buffer struct of the
  *         packet.
  * @param  ppPktLast Double-pointer to the last packet buffer struct of the
  *         packet.
  * @param  buff Pointer to the buffer.
  * @param  buffLength length of the buffer.
  * @retval None
  */
static void RxPktAssemble(void **ppPktFirst, void **ppPktLast, uint8_t *buff, uint16_t buffLength)
{
  struct pbuf **ppFirst = (struct pbuf **)ppPktFirst;
  struct pbuf **ppLast = (struct pbuf **)ppPktLast;
  struct pbuf *p;

  /* Get the struct pbuf from the buff address. */
  p = (struct pbuf *)(buff - offsetof(RxBuff_t, buff));
  p->next = NULL;
  p->tot_len = 0;
  p->len = buffLength;

  /* Chain the buffer. */
  if (!*ppFirst)
  {
    /* The first buffer of the packet. */
    *ppFirst = p;
  }
  else
  {
    /* Chain the buffer to the end of the packet. */
    (*ppLast)->next = p;
  }
  *ppLast = p;

  /* Update the total length of all the buffers of the chain. Each pbuf in the chain should have its tot_len
   * set to its own length, plus the length of all the following pbufs in the chain. */
  for (p = *ppFirst; p != NULL; p = p->next)
  {
    p->tot_len += buffLength;
  }

  /* Invalidating cache isn't necessary if the rx buffers are in a not-cacheable or write-through MPU region. */
#if ETH_RX_BUFFERS_ARE_CACHED
  /* Invalidate data cache because Rx DMA's writing to physical memory makes it stale. */
  SCB_InvalidateDCache_by_Addr((uint32_t *)buff, buffLength);
#endif
}

/**
  * @brief  Callback function given to the ETH driver at init to discard a
  *         packet.
  * @param  pPkt Pointer to the packet buffer struct.
  * @retval None
  */
static void RxPktDiscard(void *pPkt)
{
  struct pbuf *p = (struct pbuf *)pPkt;
  struct pbuf *nextp;

  while (p)
  {
    nextp = p->next;
    RxPoolCustomFree(p);
    p = nextp;
  }
}

/**
  * @brief  Initialize the Rx Buffer Pool.
  * @retval None
  */
static void RxPoolInit(void)
{
  int k;

  /* Initialize the custom_free_function of each pbuf_custom here to save
   * cycles later. */
  for (k = 0; k < ETH_RX_BUFFER_COUNT; k++)
  {
    EthIfRxBuff[k].pbuf_custom.custom_free_function = RxPoolCustomFree;
  }

  /* Initialize the Rx Buffer Pool. */
  LWIP_MEMPOOL_INIT(EthIfRxBuff);
}


static int ether_register(struct st_device *dev, char *param)
{
//	uint32_t idx = 0;
	int32_t rt;

	eventqueue_register(&interrupt_evtque, "ether_int",
			    ether_event, sizeof(unsigned char), ETH_RX_BUFFER_COUNT + 1);

	register_interrupt(IRQ2VECT(ETH_IRQn), inthdr_ether);

	EthHandle.Instance = ETH;
	EthHandle.Init.MACAddr = macaddress;
	EthHandle.Init.MediaInterface = HAL_ETH_RMII_MODE;
	EthHandle.Init.RxDesc = DMARxDscrTab;
	EthHandle.Init.TxDesc = DMATxDscrTab;
	EthHandle.Init.RxBuffLen = ETH_RX_BUF_SIZE;
	EthHandle.Init.RxBuffLen = ETH_RX_BUFFER_SIZE;

	EthHandle.Init.RxBuffAlloc = RxBuffAlloc;
	EthHandle.Init.RxBuffFree = RxBuffFree;
	EthHandle.Init.RxPktAssemble = RxPktAssemble;
	EthHandle.Init.RxPktDiscard = RxPktDiscard;

	RxPoolInit();

	/* configure ethernet peripheral (GPIOs, clocks, MAC, DMA) */
	rt = HAL_ETH_Init(&EthHandle);
	if(rt != HAL_OK) {
		tkprintf("HAL_ETH_Init Error %ld\n", rt);
	}

#if 0
	for(idx = 0; idx < ETH_RX_DESC_CNT; idx ++) {
		HAL_ETH_DescAssignMemory(&EthHandle, idx, EthIfRxBuff[idx], NULL);
//		HAL_ETH_DescAssignMemory(&EthHandle, idx, Rx_Buff[idx], Rx_Buff2[idx]);
	}
#endif

	memoryset(&TxConfig, 0, sizeof(ETH_TxPacketConfig));
	TxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
	TxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
	TxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;

	/* Set PHY IO functions */
	rt = LAN8742_RegisterBusIO(&LAN8742, &LAN8742_IOCtx);
	if(rt != LAN8742_STATUS_OK) {
		tkprintf("LAN8742_RegisterBusIO Error %ld\n", rt);
	}

#if 0	// PYHの初期化はエラーになる。初期化しなくても(なぜか)動く[TODO]
	/* Initialize the LAN8742 ETH PHY */
	rt = LAN8742_Init(&LAN8742);
	if(rt != LAN8742_STATUS_OK) {
		tkprintf("LAN8742_Init Error %ld\n", rt);
	}
#endif

	ethernet_link_check_state();

	return 0;
}

static int ether_open(struct st_device *dev)
{
	DKFPRINTF(0x01, "\n");

	HAL_NVIC_SetPriority(ETH_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(ETH_IRQn);

	HAL_ETH_Start_IT(&EthHandle);

	return 0;
}

static int ether_close(struct st_device *dev)
{
	DKFPRINTF(0x01, "\n");

	HAL_ETH_Stop(&EthHandle);

	return 0;
}

static int ether_read(struct st_device *dev, void *data, unsigned int size)
{
//	ETH_BufferTypeDef RxBuff;
	struct pbuf *RxBuff;
	uint32_t framelength = 0;
	uint32_t errorCode;

	DKFPRINTF(0x01, "size = %d\n", size);

#if 0
	if(HAL_ETH_IsRxDataAvailable(&EthHandle) == 0) {
		DKPRINTF(0x07, "ETH no Receive data\n");
		goto readend;
	} else {
		DKPRINTF(0x03, "ETH Receive OK\n");
	}
#endif

	DKPRINTF(0x01, "RxState = %d\n", (int)EthHandle.RxState);

	if(HAL_ETH_GetRxDataBuffer(&EthHandle, (void **)&RxBuff) == HAL_OK)  {
		ETH_RxPacketInfo RxPacketInfo;
		DKPRINTF(0x20, "buff = %p\n", RxBuff);
		DKPRINTF(0x20, "len = %d\n", RxBuff->len);
		KXBDUMP(0x20, (unsigned char *)RxBuff->payload, RxBuff->len);

//		tkprintf("BuildDescCount = %d\n", EthHandle.RxDescList.Pkt.BuildDescCount);

		HAL_ETH_GetRxDataInfo(&EthHandle, &RxPacketInfo);
		if(RxPacketInfo.SegmentCnt > 1) {
			tkprintf("SegmentCnt = %lu\n", RxPacketInfo.SegmentCnt);
		}
		//DKPRINTF(0x80, "ErrorCode = %lu\n", RxPacketInfo.ErrorCode);

