GadgetSeed/gadgetseed/arch/Cortex-M7/drivers/stm32h747i-disc_ether.c
		HAL_ETH_GetRxDataErrorCode(&EthHandle, &errorCode);
		if(errorCode) {
			RxPktDiscard(RxBuff);
		} else {
			framelength = RxBuff->len;
			if(framelength > size) {
				tkprintf("size over %ld %u\n", framelength, size);
			}
			//SCB_InvalidateDCache_by_Addr((uint32_t *)RxBuff->payload, framelength);
			memorycopy(data, RxBuff->payload, framelength);
			if(RxBuff->next != 0) {
				tkprintf("next = %p\n", RxBuff->next);
			}
			RxPktDiscard(RxBuff);
		}

//		int dn = EthHandle.RxDescList.AppDescNbr;
//		if(dn > 1) {
//			tkprintf("AppDescNbr = %d\n", dn);
//		}
//		DKPRINTF(0x20, "CurRxDesc = %lu\n", EthHandle.RxDescList.CurRxDesc);
//		DKPRINTF(0x20, "FirstAppDesc = %lu\n", EthHandle.RxDescList.FirstAppDesc);
//		DKPRINTF(0x20, "AppDescNbr = %lu\n", EthHandle.RxDescList.AppDescNbr);
//		DKPRINTF(0x20, "AppContextDesc = %lu\n", EthHandle.RxDescList.AppContextDesc);
//		DKPRINTF(0x20, "ItMode = %lu\n", EthHandle.RxDescList.ItMode);

//		HAL_ETH_GetRxDataLength(&EthHandle, &framelength);
//		DKPRINTF(0x03, "framelength = %lu\n", framelength);

		/* Build Rx descriptor to be ready for next data reception */
//!!!		HAL_ETH_BuildRxDescriptors(&EthHandle);

		/* Invalidate data cache for ETH Rx Buffers */
//		SCB_InvalidateDCache_by_Addr((uint32_t *)RxBuff.buffer, framelength);

//		memorycopy(data, RxBuff.buffer, framelength);
//		KXBDUMP(0x01, RxBuff.buffer, framelength);

//!!!		HAL_ETH_BuildRxDescriptors(&EthHandle);//!!!
	}
//	if(HAL_ETH_GetRxDataBuffer(&EthHandle, (void **)&RxBuff) == HAL_OK)  {
//		DKPRINTF(0x40, "buff = %p\n", RxBuff);
//		DKPRINTF(0x40, "len = %d\n", RxBuff->len);
//		HAL_ETH_GetRxDataErrorCode(&EthHandle, &errorCode);
//	}

//!!!readend:
	return framelength;
}

#define ETH_DMA_TRANSMIT_TIMEOUT                (20U)

static int ether_write(struct st_device *dev, const void *data, unsigned int size)
{
	int rt = 0;
	int rtn = size;
	ETH_BufferTypeDef TxBuff[ETH_TX_DESC_CNT];

//	memoryset(&Tx_Buff[0], 0, ETH_TX_DESC_CNT*sizeof(ETH_BufferTypeDef));

//	memorycopy(&Tx_Buff[0], data, size);
//	SCB_CleanDCache_by_Addr((uint32_t *)&Tx_Buff[0], size);

//	TxBuff[0].buffer = (uint8_t *)&Tx_Buff[0];
	uint8_t *dataStart = (uint8_t *)data;
	uint8_t *lineStart = (uint8_t *)((uint32_t)dataStart & ~31);
	SCB_CleanDCache_by_Addr((uint32_t *)lineStart, size + (dataStart - lineStart));

	TxBuff[0].buffer = (uint8_t *)data;
	TxBuff[0].len = size;
	TxBuff[0].next = 0;

	TxConfig.Length = size;
	TxConfig.TxBuffer = TxBuff;

	DKFPRINTF(0x04, "size = %d\n", size);
	KXBDUMP(0x04, TxBuff[0].buffer, TxBuff[0].len);

//	rt = HAL_ETH_Transmit(&EthHandle, &TxConfig, ETH_DMA_TRANSMIT_TIMEOUT);
	rt = HAL_ETH_Transmit_IT(&EthHandle, &TxConfig);
	if(rt != HAL_OK) {
		SYSERR_PRINT("HAL_ETH_Transmit error(%d)\n", rt);
	}

	return rtn;
}

static int ether_ioctl(struct st_device *dev, unsigned int com, unsigned int arg, void *param)
{
	DKFPRINTF(0x08, "com = %08X, arg = %u\n", com, arg);

	switch(com) {
	case IOCMD_ETHER_GET_MACADDR:	// MACアドレス取得
		{
			unsigned char *mac = (unsigned char *)param;
			int i;

			for(i=0; i<6; i++) {
				mac[i] = macaddress[i];
			}

			DKPRINTF(0x01, "MAC Addr %02X:%02X:%02X:%02X:%02X:%02X\n",
				 (int)mac[0], (int)mac[1], (int)mac[2],
				 (int)mac[3], (int)mac[4], (int)mac[5]);
		}
		break;

	case IOCMD_ETHER_SET_MACADDR:	// MACアドレス設定
		return -1;	// [TODO]
		break;

	case IOCMD_ETHER_CLEAR_BUF:
		break;

	case IOCMD_ETHER_LINK_UP:
		HAL_ETH_Start_IT(&EthHandle);
		break;

	case IOCMD_ETHER_LINK_DOWN:
		HAL_ETH_Stop(&EthHandle);
		break;

	case IOCMD_ETHER_GET_LINK_STATUS:
		{
			int stat = 0;

			stat = ethernet_link_check_state();
#if 1	// リンク状態が正しく取れないようなので強制的に100M FULLとしている[TODO]
			stat |= IORTN_BIT_ETHER_LINK_UP;
			stat |= IORTN_BIT_ETHER_100M;
			stat |= IORTN_BIT_ETHER_FULLDUPLEX;
#endif

			return stat;
		}
		break;

	default:
		SYSERR_PRINT("Unknow command %08X arg %08X\n", com, arg);
		break;
	}

	return 0;
}

static int ether_epbuf_get(struct st_device *dev, void **data)
{
	struct pbuf *RxBuff;
	uint32_t errorCode;
	ETH_RxPacketInfo RxPacketInfo;
	HAL_StatusTypeDef rtn;

	DKFPRINTF(0x20, "data = %p\n", data);
	DKPRINTF(0x01, "RxState = %d\n", (int)EthHandle.RxState);

	rtn = HAL_ETH_GetRxDataBuffer(&EthHandle, data);
	if(rtn == HAL_OK)  {
		RxBuff = *data;
		DKFPRINTF(0x20, "RxBuff = %p\n", RxBuff);
		DKPRINTF(0x20, "buff = %p\n", RxBuff);
		DKPRINTF(0x20, "len = %d\n", RxBuff->len);
		KXBDUMP(0x20, (unsigned char *)RxBuff->payload, RxBuff->len);

//		tkprintf("BuildDescCount = %d\n", EthHandle.RxDescList.Pkt.BuildDescCount);

		HAL_ETH_GetRxDataInfo(&EthHandle, &RxPacketInfo);
		if(RxPacketInfo.SegmentCnt > 1) {
			tkprintf("SegmentCnt = %lu\n", RxPacketInfo.SegmentCnt);
		}

		HAL_ETH_GetRxDataErrorCode(&EthHandle, &errorCode);
		if(errorCode) {
			RxPktDiscard(RxBuff);
			RxPacketInfo.SegmentCnt = 0;
		}
	} else {
		tkprintf("HAL_ETH_GetRxDataBuffer error %d\n", rtn);
		RxPacketInfo.SegmentCnt = 0;
	}

	return RxPacketInfo.SegmentCnt;
}

static int ether_epbuf_release(struct st_device *dev, void *data)
{
	struct pbuf *RxBuff = data;

	DKFPRINTF(0x20, "data = %p\n", data);

	RxPktDiscard(RxBuff);

	return 0;
}

static int ether_select(struct st_device *dev, unsigned int timeout)
{
	DKFPRINTF(0x08, "timeout = %d\n", timeout);

	int rtn = 0;

	rtn = event_wait(&interrupt_evtque, 0, timeout);

	DKFPRINTF(0x08, "return=%d\n", rtn);

	return rtn;
}


const struct st_device ether_device = {
	.name		= DEF_DEV_NAME_ETHER,
	.explan		= "STM32H747I-Discovery Ether",
	.register_dev	= ether_register,
	.open		= ether_open,
	.close		= ether_close,
	.read		= ether_read,
	.write		= ether_write,
	.ioctl		= ether_ioctl,
	.epbuf_get	= ether_epbuf_get,
	.epbuf_release	= ether_epbuf_release,
	.select		= ether_select,
};
